import { Component } from '@angular/core';

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.scss']
})
export class AppComponent {
  pics = [
    {
      id: 1,
      url: 'assets/img/jeans.png',
      alt: 'Джинси',
      params: {
        colour: "Блакитний",
        size: "S-М"
      },
      descr: 'Базова модель джинсів МОМ, світлого блакитного відтінку. Тягнуться за рахунок еластану у складі, оздоблені п\'ятьма кишенями. Висока посадка та оброблений край, застібаються на металевий ґудзик та блискавку.',
      price: 1700,
      remains: 5
    },
    {
      id: 2,
      url: 'assets/img/cardigans.png',
      alt: 'Кардиган',
      params: {
        colour: "Бежевий",
        size: "S-L (universal)"
      },
      descr: 'Бежевий кардиган - стильний і зручний елемент гардеробу. Виготовлений з високоякісної тканини, цей кардиган з натискними кнопками і відкладним коміром додасть вашому образу тепла і елегантності.',
      price: 900,
      remains: 2
    },
    {
      id: 3,
      url: 'assets/img/denim-jacket.png',
      alt: 'Джинсовий жакет',
      params: {
        colour: "Коричневий",
        size: "S-М"
      },
      descr: 'Коричневий джинсовий жакет - стильний і зручний вибір. Uатуральний колір нададуть образу легкість і шарм. Підкресліть свій стиль цим універсальним джинсовим жакетом, що легко поєднується з різними образами.',
      price: 1200 ,
      remains: 4
    },
    {
      id: 4,
      url: 'assets/img/sandals.png',
      alt: 'Босоніжки',
      params: {
        colour: "М'ята",
        size: "36/37/38/39/40"
      },
      descr: 'Мятні босоніжки - свіжий і яскравий акцент для вашого літнього гардеробу. Зручний дизайн і насичений м\'ятний колір нададуть вашому вигляду легкість і стиль. Ці босоніжки ідеально підкреслять вашу елегантність.',
      price: 700,
      remains: 22
    },
    {
      id: 5,
      url: 'assets/img/t-shirts.png',
      alt: 'Футболка',
      params: {
        colour: "Білий/Бежевий/Коричневий",
        size: "S-L (universal)"
      },
      descr: 'Однотонні футболки - класика зручності та стилю. У різних кольорах вони стануть невід\'ємною частиною вашого прекрасного гардеробу. Виразіть свій стиль з цими універсальними футболками.',
      price: 550,
      remains: 15
    },
    {
      id: 6,
      url: 'assets/img/sweater.png',
      alt: 'Светр',
      params: {
        colour: "Білий/Бежевий/Коричневий",
        size: "S-М"
      },
      descr: 'Светри - невід\'ємний елемент стильного та комфортного гардеробу. В білому, бежевому та коричневому кольорах, вони додають класичний шарм вашому образу. Зручний крій та приємні на дотик матеріали.',
      price: 800,
      remains: 3
    }
  ];
}
